<?php    

    global $wpdb;

    $table_accs = $wpdb->prefix.'accs';
    $table_hotels = $wpdb->prefix.'hotels';
    $table_hotel_fotos = $wpdb->prefix.'hotel_foto';
    $table_numbers = $wpdb->prefix.'numbers';
    $table_busy = $wpdb->prefix.'busy';
    $table_orders = $wpdb->prefix.'orders';
    $table_clients = $wpdb->prefix.'clients';
    $table_diapasones = $wpdb->prefix.'diapasones';
    $table_numbers2diapasones = $wpdb->prefix.'numbers2diapasones';
    $table_number_groups = $wpdb->prefix.'number_groups';
    
    // TODO
    // Внесение базы городов
    
    
    $sql = "CREATE TABLE IF NOT EXISTS $table_accs (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `name` varchar(30) NOT NULL,
              PRIMARY KEY (`id`)
            ) ENGINE=MyISAM DEFAULT CHARSET=utf8  AUTO_INCREMENT=100";

    $wpdb->query($sql);
    
    $sql = "INSERT INTO $table_accs VALUES
            (1, 'Алушта'), (2, 'Ялта')";

    $wpdb->query($sql);
    //===================================================
    $sql = "CREATE TABLE IF NOT EXISTS $table_hotels (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `name` varchar(30) NOT NULL,
              `country` varchar(30) NOT NULL,
              `city` varchar(30) NOT NULL,
              `desc` varchar(1000) NOT NULL,
              `accID` int(11) NOT NULL,
              PRIMARY KEY (`id`)
            ) ENGINE=MyISAM DEFAULT CHARSET=utf8  AUTO_INCREMENT=100";

    $wpdb->query($sql);
    //===================================================
    $sql = "CREATE TABLE IF NOT EXISTS $table_hotel_fotos (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `hotelID` int(11) NOT NULL,
              `path` varchar(300) NOT NULL,
              PRIMARY KEY (`id`)
            ) ENGINE=MyISAM DEFAULT CHARSET=utf8  AUTO_INCREMENT=1";

    $wpdb->query($sql);
    //===================================================
    $sql = "INSERT INTO $table_hotels VALUES
            (1, 'Алушта1', 'Украина', 'Алушта', 1), (2, 'Алушта2', 'Россия', 'Москва',  1),
            (3, 'Алушта3', 'Россия', 'Москва',  1), (4, 'Алушта4', 'Турция', 'Анкара',  1),
            (5, 'Ялта1', 'Турция', 'Анкара',  2), (6, 'Ялта2', 'Украина', 'Алушта',  2),
            (7, 'Ялта3', 'Россия', 'Москва',  2), (8, 'Ялта4', 'Турция', 'Анкара',  2);";

    $wpdb->query($sql);
    //===================================================
    $sql = "CREATE TABLE IF NOT EXISTS $table_hotels (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `name` varchar(30) NOT NULL,
              `rooms` tinyint(4) NOT NULL,
              `places` tinyint(4) NOT NULL,
              `additional_places` tinyint(4) NOT NULL,
              `hotelID` tinyint(4) NOT NULL,
              PRIMARY KEY (`id`)
            ) ENGINE=MyISAM  DEFAULT CHARSET=utf8";
    
    $wpdb->query($sql);
    //===================================================
    $sql = "CREATE TABLE IF NOT EXISTS $table_numbers (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `name` varchar(30) NOT NULL,
              `rooms` tinyint(4) NOT NULL,
              `places` tinyint(4) NOT NULL,
              `additional_places` tinyint(4) NOT NULL,
              `hotelID` tinyint(4) NOT NULL,
              PRIMARY KEY (`id`)
            ) ENGINE=MyISAM  DEFAULT CHARSET=utf8";
    
    $wpdb->query($sql);

    $sql = "INSERT INTO $table_numbers (`id`, `name`, `rooms`, `places`, `additional_places`, `hotelID`) VALUES
            (1, '№ 15 (одноместный)', 1, 1, 1, 1),
            (2, '№ 1', 1, 2, 0, 1),
            (3, '№ 2', 1, 2, 0, 1),
            (4, '№ 3', 1, 2, 0, 1),
            (5, '№ 6', 1, 2, 0, 1),
            (6, '№ 9', 1, 2, 0, 1),
            (7, '№ 18', 1, 2, 0, 1),
            (8, '№ 21', 1, 2, 0, 1),
            (9, '№ 7', 1, 2, 1, 1),
            (10, '№ 8', 1, 2, 1, 1),
            (11, '№ 10', 1, 2, 1, 1),
            (12, '№ 19', 1, 2, 1, 1),
            (13, '№ 20', 1, 2, 1, 1),
            (14, 'Полулюкс № 11', 1, 2, 1, 1),
            (15, 'Полулюкс № 12', 1, 2, 1, 1),
            (16, 'Полулюкс Восточный', 1, 2, 2, 1),
            (17, 'Люкс категории Б № 4', 2, 2, 2, 1),
            
            (18, 'Люкс категории А № 5', 2, 2, 2, 1),
            
            (19, 'Апартаменты 1 этаж', 1, 2, 1, 1),
            (20, 'Апартаменты Б №24', 2, 3, 2, 1),
            (21, 'Апартаменты А №5', 2, 3, 2, 1),
            (25, 'Люкс Классика №17', 2, 2, 2, 1),
            
            (26, 'Люкс категории А №14', 2, 2, 2, 1),
            (27, 'Люкс категории А №16', 2, 2, 2, 1),
            (28, 'Люкс категории А №22', 2, 2, 2, 1);";

    
    $wpdb->query($sql);
    
    $sql = "INSERT INTO $table_numbers (`id`, `name`, `rooms`, `places`, `additional_places`, `hotelID`) VALUES
            (1, '№ 15 (одноместный)', 1, 1, 1, 2),
            (2, '№ 1', 1, 2, 0, 2),
            (3, '№ 2', 1, 2, 0, 2),
            (4, '№ 3', 1, 2, 0, 2),
            (5, '№ 6', 1, 2, 0, 2),
            (6, '№ 9', 1, 2, 0, 2),
            (7, '№ 18', 1, 2, 0, 2),
            (8, '№ 21', 1, 2, 0, 2),
            (9, '№ 7', 1, 2, 1, 2),
            (10, '№ 8', 1, 2, 1, 2),
            (11, '№ 10', 1, 2, 1, 2),
            (12, '№ 19', 1, 2, 1, 2),
            (13, '№ 20', 1, 2, 1, 2),
            (14, 'Полулюкс № 11', 1, 2, 1, 2),
            (15, 'Полулюкс № 12', 1, 2, 1, 2),
            (16, 'Полулюкс Восточный', 1, 2, 2, 2),
            (17, 'Люкс категории Б № 4', 2, 2, 2, 2),
            
            (18, 'Люкс категории А № 5', 2, 2, 2, 2),
            
            (19, 'Апартаменты 1 этаж', 1, 2, 1, 2),
            (20, 'Апартаменты Б №24', 2, 3, 2, 2),
            (21, 'Апартаменты А №5', 2, 3, 2, 2),
            (25, 'Люкс Классика №17', 2, 2, 2, 2),
            
            (26, 'Люкс категории А №14', 2, 2, 2, 2),
            (27, 'Люкс категории А №16', 2, 2, 2, 2),
            (28, 'Люкс категории А №22', 2, 2, 2, 2);";

    
    $wpdb->query($sql);
    //===================================================
    $sql = "CREATE TABLE IF NOT EXISTS $table_number_groups (
              `idx` int(11) NOT NULL AUTO_INCREMENT,
              `id_group` int(11) NOT NULL,
              `id_number` int(11) NOT NULL,
              `group_rus_name` varchar(30) NOT NULL,
              `group_en_name` varchar(30) NOT NULL,
              PRIMARY KEY (`idx`)
            ) ENGINE=MyISAM DEFAULT CHARSET=utf8  AUTO_INCREMENT=100";

    $wpdb->query($sql);

    $sql = "INSERT INTO $table_number_groups VALUES
            (1, 1, 1, 'Одноместный', 'Одноместный'),
            
            (2, 2, 2, 'Стандарт', 'Стандарт'),
            (3, 2, 3, 'Стандарт', 'Стандарт'),
            (4, 2, 4, 'Стандарт', 'Стандарт'),
            (5, 2, 5, 'Стандарт', 'Стандарт'),
            (6, 2, 6, 'Стандарт', 'Стандарт'),
            (7, 2, 7, 'Стандарт', 'Стандарт'),
            (8, 2, 8, 'Стандарт', 'Стандарт'),
            
            (9, 3, 9, 'Стандарт', 'Стандарт'),
            (10, 3, 10, 'Стандарт', 'Стандарт'),
            (11, 3, 11, 'Стандарт', 'Стандарт'),
            (12, 3, 12, 'Стандарт', 'Стандарт'),
            (13, 3, 13, 'Стандарт', 'Стандарт'),
            
            (14, 4, 14, 'Полулюкс', 'Полулюкс'),
            (15, 4, 15, 'Полулюкс', 'Полулюкс'),
            
            (16, 5, 16, 'Полулюкс «Восточный»', 'Полулюкс «Восточный»'),
            (17, 6, 17, 'Люкс категории «Б»', 'Люкс категории «Б»'),
            (18, 7, 18, 'Люкс категории «А»', 'Люкс категории «А»'),
            (19, 8, 25, 'Люкс «Классика»', 'Люкс «Классика»'),
            (20, 9, 19, 'Апартаменты 1 этаж', 'Апартаменты 1 этаж'),
            (21, 10, 20, 'Апартаменты «Б»', 'Апартаменты «Б»'),
            (22, 11, 21, 'Апартаменты «А»', 'Апартаменты «А»'),
            (100, 7, 26, 'Люкс категории «А»', 'Люкс категории «А»'),
            (101, 7, 27, 'Люкс категории «А»', 'Люкс категории «А»'),
            (102, 7, 28, 'Люкс категории «А»', 'Люкс категории «А»'); ";
            
    $wpdb->query($sql);
    //====================================================
    $sql = "CREATE TABLE IF NOT EXISTS $table_busy (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `numbersID` int(11) NOT NULL,
              `date` date NOT NULL,
              `ordersID` int(11) NOT NULL,
              PRIMARY KEY (`id`)
            ) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=3 ;";
    $wpdb->query($sql);
    //====================================================
    $sql = "CREATE TABLE IF NOT EXISTS $table_clients (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `name` varchar(50) NOT NULL,
              `mail` varchar(30) NOT NULL,
              `phone` varchar(15) NOT NULL,
              PRIMARY KEY (`id`)
            ) ENGINE=MyISAM DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;";
    $wpdb->query($sql);
    //====================================================
    $sql = "CREATE TABLE IF NOT EXISTS $table_diapasones (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `date_start` date NOT NULL,
              `date_finish` date NOT NULL,
              PRIMARY KEY (`id`)
            ) ENGINE=MyISAM DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;";
    $wpdb->query($sql);
    
    $sql = "INSERT INTO $table_diapasones (`id`, `date_start`, `date_finish`) VALUES
            (1, '2012-01-01', '2012-01-10'),
            (2, '2012-01-11', '2012-04-27'),
            (3, '2012-04-28', '2012-05-11'),
            (4, '2012-05-12', '2012-05-31'),
            (5, '2012-06-01', '2012-06-30'),
            (6, '2012-07-01', '2012-08-31'),
            (7, '2012-09-01', '2012-09-30'),
            (8, '2012-10-01', '2012-12-28'),
            (10, '2012-12-29', '2012-12-31');";
    $wpdb->query($sql);
    //====================================================
    $sql = "CREATE TABLE IF NOT EXISTS $table_numbers2diapasones (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `numbersID` int(11) NOT NULL,
              `diapasonesID` int(11) NOT NULL,
              `price` int(11) NOT NULL,
              `additional_place_price` int(11) NOT NULL,
              PRIMARY KEY (`id`)
            ) ENGINE=MyISAM DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;";
    $wpdb->query($sql);
    
    $sql = "INSERT INTO $table_numbers2diapasones (`id`, `numbersID`, `diapasonesID`, `price`, `additional_place_price`) VALUES
    (172, 2, 10, 370, 130),(171, 1, 10, 200, 130),(3, 1, 1, 200, 130),(4, 1, 2, 200, 100),
    (5, 1, 3, 200, 130),(6, 1, 4, 200, 100),(7, 1, 5, 200, 130),(8, 1, 6, 350, 150),
    (9, 1, 7, 200, 130),(10, 1, 8, 200, 100),(11, 2, 1, 370, 130),(12, 2, 2, 250, 100),
    (13, 2, 3, 370, 130),(14, 2, 4, 250, 100),(15, 2, 5, 370, 130),(16, 2, 6, 600, 150),
    (17, 2, 7, 370, 130),(18, 2, 8, 250, 100),(19, 3, 1, 370, 130),(20, 3, 2, 250, 100),
    (21, 3, 3, 370, 130),(22, 3, 4, 250, 100),(23, 3, 5, 370, 130),(24, 3, 6, 600, 150),
    (25, 3, 7, 370, 130),(26, 3, 8, 250, 100),(27, 4, 1, 370, 130),(28, 4, 2, 250, 100),
    (29, 4, 3, 370, 130),(30, 4, 4, 250, 100),(31, 4, 5, 370, 130),(32, 4, 6, 600, 150),
    (33, 4, 7, 370, 130),(34, 4, 8, 250, 100),(35, 5, 1, 370, 130),(36, 5, 2, 250, 100),
    (37, 5, 3, 370, 130),(38, 5, 4, 250, 100),(39, 5, 5, 370, 130),(40, 5, 6, 600, 150),
    (41, 5, 7, 370, 130),(42, 5, 8, 250, 100),(43, 6, 1, 370, 130),(44, 6, 2, 250, 100),
    (45, 6, 3, 370, 130),(46, 6, 4, 250, 100),(47, 6, 5, 370, 130),(48, 6, 6, 600, 150),
    (49, 6, 7, 370, 130),(50, 6, 8, 250, 100),(51, 7, 1, 370, 130),(52, 7, 2, 250, 100),
    (53, 7, 3, 370, 130),(54, 7, 4, 250, 100),(55, 7, 5, 370, 130),(56, 7, 6, 600, 150),
    (57, 7, 7, 370, 130),(58, 7, 8, 250, 100),(59, 8, 1, 370, 130),(60, 8, 2, 250, 100),
    (61, 8, 3, 370, 130),(62, 8, 4, 250, 100),(63, 8, 5, 370, 130),(64, 8, 6, 600, 150),
    (65, 8, 7, 370, 130),(66, 8, 8, 250, 100),(67, 9, 1, 370, 130),(68, 9, 2, 250, 100),
    (69, 9, 3, 370, 130),(70, 9, 4, 250, 100),(71, 9, 5, 370, 130),(72, 9, 6, 600, 150),
    (73, 9, 7, 370, 130),(74, 9, 8, 250, 100),(75, 10, 1, 370, 130),(76, 10, 2, 250, 100),
    (77, 10, 3, 370, 130),(78, 10, 4, 250, 100),(79, 10, 5, 370, 130),(80, 10, 6, 600, 150),
    (81, 10, 7, 370, 130),(82, 10, 8, 250, 100),(83, 11, 1, 370, 130),(84, 11, 2, 250, 100),
    (85, 11, 3, 370, 130),(86, 11, 4, 250, 100),(87, 11, 5, 370, 130),(88, 11, 6, 600, 150),
    (89, 11, 7, 370, 130),(90, 11, 8, 250, 100),(91, 12, 1, 370, 130),(92, 12, 2, 250, 100),
    (93, 12, 3, 370, 130),(94, 12, 4, 250, 100),(95, 12, 5, 370, 130),(96, 12, 6, 600, 150),
    (97, 12, 7, 370, 130),(98, 12, 8, 250, 100),(99, 13, 1, 370, 130),(100, 13, 2, 250, 100),
    (101, 13, 3, 370, 130),(102, 13, 4, 250, 100),(103, 13, 5, 370, 130),(104, 13, 6, 600, 150),
    (105, 13, 7, 370, 130),(106, 13, 8, 250, 100),(107, 14, 1, 420, 130),(108, 14, 2, 300, 100),
    (109, 14, 3, 420, 130),(110, 14, 4, 300, 100),(111, 14, 5, 420, 130),(112, 14, 6, 650, 150),
    (113, 14, 7, 420, 130),(114, 14, 8, 300, 100),(115, 15, 1, 420, 130),(116, 15, 2, 300, 100),
    (117, 15, 3, 420, 130),(118, 15, 4, 300, 100),(119, 15, 5, 420, 130),(120, 15, 6, 650, 150),
    (121, 15, 7, 420, 130),(122, 15, 8, 300, 100),(123, 16, 1, 470, 130),(124, 16, 2, 330, 100),
    (125, 16, 3, 470, 130),(126, 16, 4, 330, 100),(127, 16, 5, 470, 130),(128, 16, 6, 700, 150),
    (129, 16, 7, 470, 130),(130, 16, 8, 330, 100),(131, 17, 1, 500, 130),(132, 17, 2, 350, 100),
    (133, 17, 3, 500, 130),(134, 17, 4, 350, 100),(135, 17, 5, 500, 130),(136, 17, 6, 720, 150),
    (137, 17, 7, 500, 130),(138, 17, 8, 350, 100),(139, 18, 1, 530, 130),(140, 18, 2, 380, 100),
    (141, 18, 3, 530, 130),(142, 18, 4, 380, 100),(143, 18, 5, 530, 130),(144, 18, 6, 750, 150),
    (145, 18, 7, 530, 130),(146, 18, 8, 380, 100),(147, 19, 1, 630, 130),(148, 19, 2, 450, 100),
    (149, 19, 3, 630, 130),(150, 19, 4, 450, 100),(151, 19, 5, 630, 130),(152, 19, 6, 950, 150),
    (153, 19, 7, 630, 130),(154, 19, 8, 450, 100),(155, 20, 1, 750, 130),(156, 20, 2, 480, 100),
    (157, 20, 3, 750, 130),(158, 20, 4, 480, 100),(159, 20, 5, 750, 130),(160, 20, 6, 1200, 150),
    (161, 20, 7, 750, 130),(162, 20, 8, 480, 100),(163, 21, 1, 750, 130),(164, 21, 2, 500, 100),
    (165, 21, 3, 750, 130),(166, 21, 4, 500, 100),(167, 21, 5, 750, 130),(168, 21, 6, 1300, 150),
    (169, 21, 7, 750, 130),(170, 21, 8, 500, 100),(173, 3, 10, 370, 130),(174, 4, 10, 370, 130),
    (175, 5, 10, 370, 130),(176, 6, 10, 370, 130),(177, 7, 10, 370, 130),(178, 8, 10, 370, 130),
    (179, 9, 10, 370, 130),(180, 10, 10, 370, 130),(181, 11, 10, 370, 130),(182, 12, 10, 370, 130),
    (183, 13, 10, 370, 130),(184, 14, 10, 420, 130),(185, 15, 10, 420, 130),(186, 16, 10, 470, 130),
    (187, 17, 10, 500, 130),(188, 18, 10, 530, 130),(189, 19, 10, 630, 130),(190, 20, 10, 750, 130),
    (191, 21, 10, 750, 130),(192, 25, 1, 580, 130),(193, 25, 2, 400, 100),(194, 25, 3, 580, 130),
    (195, 25, 4, 400, 100),(196, 25, 5, 580, 130),(197, 25, 6, 800, 150),(198, 25, 7, 400, 130),
    (199, 25, 8, 580, 100),(200, 25, 10, 400, 130),(1139, 26, 1, 530, 130),(1140, 26, 2, 380, 100),
    (1141, 26, 3, 530, 130),(1142, 26, 4, 380, 100),(1143, 26, 5, 530, 130),(1144, 26, 6, 750, 150),
    (1145, 26, 7, 530, 130),(1146, 26, 8, 380, 100),(1188, 26, 10, 530, 130),(2139, 27, 1, 530, 130),
    (2140, 27, 2, 380, 100),(2141, 27, 3, 530, 130),(2142, 27, 4, 380, 100),(2143, 27, 5, 530, 130),
    (2144, 27, 6, 750, 150),(2145, 27, 7, 530, 130),(2146, 27, 8, 380, 100),(2188, 27, 10, 530, 130),
    (3139, 28, 1, 530, 130),(3140, 28, 2, 380, 100),(3141, 28, 3, 530, 130),(3142, 28, 4, 380, 100),
    (3143, 28, 5, 530, 130),(3144, 28, 6, 750, 150),(3145, 28, 7, 530, 130),(3146, 28, 8, 380, 100),
    (3188, 28, 10, 530, 130);";    
    $wpdb->query($sql);
    //====================================================
    $sql = "CREATE TABLE IF NOT EXISTS $table_orders (
              `id` int(11) NOT NULL AUTO_INCREMENT,
              `state` varchar(10) NOT NULL,
              `mail_sent` tinyint(4) NOT NULL,
              `date` date NOT NULL,
              `additional_place` tinyint(4) NOT NULL,
              `clientID` int(11) NOT NULL,
              PRIMARY KEY (`id`)
            ) ENGINE=MyISAM DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;";
    
    $wpdb->query($sql);
    
?>